[
  {
    "term": "目次",
    "desc": " 第2章 AWSクラウドの概念\n 第3章 AWSのセキュリティ\n 第4章 AWSのテクノロジとサービス\n 第5章 コンピューティングサービス\n 第6章 ストレージサービス\n 第7章 ネットワークサービス\n 第8章 データベースサービス\n 第9章 AI/ML、ビジネス、分析サービス\n 第10章 オートメーション、デプロイ\n 第11章 モニタリング、管理サービス\n 第12章 移行、導入戦略\n 第13章 請求、料金、およびサポート"
  },
  {
    "term": "AWS",
    "desc": "AWS（Amazon Web Services）とは、Amazonが提供するクラウドコンピューティングサービスの総称で、インターネット経由でサーバー、ストレージ、データベース、AI、機械学習など多岐にわたるITリソースを必要な時に必要な分だけ利用できるサービスです。自社で物理的なサーバーを持つことなく、システム構築や運用が手軽にでき、従量課金制でコストを抑えつつ、高い拡張性や俊敏性を実現できるのが特徴です。"
  },
  {
    "term": "EC",
    "desc": "EC2（Amazon Elastic Compute Cloud）とは、Amazon Web Services (AWS) が提供するクラウド上の仮想サーバー（仮想マシン）を提供するサービスです。数分でサーバーを構築でき、CPUやメモリなどのスペックを柔軟に変更可能（スケーラビリティ）、ウェブサイトのホスティング、データベース、機械学習など様々な用途に利用され、利用した時間分だけ料金が発生する従量課金制が特徴です。"
  },
  {
    "term": "Amazon ECR",
    "desc": "Amazon ECR (Elastic Container Registry) とは、AWSが提供するフルマネージド型のコンテナレジストリサービスで、Dockerなどのコンテナイメージを安全に保存、管理、共有、デプロイできるサービスです。AWSの他のサービス（ECS, EKS, Lambdaなど）とシームレスに連携し、高い可用性とセキュリティを提供し、インフラの運用不要でコンテナライフサイクル全体を管理できます。"
  },
  {
    "term": "Amazon EBS",
    "desc": "Amazon EBS（Elastic Block Store）は、Amazon Web Services (AWS)のブログが提供する、Amazon EC2（仮想サーバー）にアタッチして利用する高性能なブロックストレージサービスです。EC2インスタンスの「ハードディスク」のような役割を果たし、ファイルシステムを構築したり、データベースを動かしたりと、OSやアプリケーションのデータを保存・管理するために使われます。特定のアベイラビリティーゾーン内で自動的にデータが複製され、高い耐久性と可用性を持ち、スナップショット機能でバックアップも可能です。"
  },
  {
    "term": "Amazon S3",
    "desc": "Amazon S3 (Simple Storage Service) とは、AWSが提供するオブジェクトストレージサービスで、インターネット経由であらゆる量のデータを保存・取得でき、容量無制限、高い耐久性・可用性、低コスト、高いセキュリティを特徴とし、バックアップ、Webサイトのコンテンツ配信、データ分析基盤など、多様な用途で利用されます。データは「バケット」と呼ばれる入れ物に「オブジェクト（ファイル）」として保存され、どこからでもアクセス可能です。"
  }
  {
    "term": "AWS RDS",
    "desc": "AWS RDS（Amazon Relational Database Service）とは、AWSが提供する「マネージド型」のリレーショナルデータベース（RDB）サービスで、データベースのインストール、設定、バックアップ、パッチ適用といった運用管理の手間をAWSが代行し、利用者はすぐにデータベースを利用開始・運用できるため、インフラ管理の負担を大幅に軽減できます。",
    "tags": [
      "DB"
    ]
  },
  {
    "term": "IAMロール",
    "desc": "IAMロールとは、AWSなどのクラウド環境で、AWSサービス（EC2、Lambdaなど）や他のアカウント、外部の連携サービスに対して一時的に特定の操作権限（ポリシー）を付与する仕組みです。ユーザーアカウントに直接権限を与えるのではなく、「役割」として設定し、必要に応じてその役割を引き受ける（スイッチする）ことで、一時的な認証情報で安全にリソースへのアクセスを許可します",
    "tags": [
      "IAM"
    ]
  },
  {
    "term": "IAMポリシー",
    "desc": "IAMポリシーとは、AWSにおいて「誰が（Who）」「どのサービス（What）」「どのリソースに対して（Where）」「どんな操作（Action）」を許可または拒否するかをJSON形式で定義し、ユーザーやロールに割り当ててアクセス権限を管理する設定ファイルのことです。主に「Effect（許可/拒否）」「Action（アクション）」「Resource（リソース）」「Condition（条件）」の要素で構成され、最小権限の原則に基づき細かく制御できます。",
    "tags": [
      "IAM"
    ]
  },
  {
    "term": "IAM Identity Center",
    "desc": "IAM Identity Centerは、AWS Organizationsを利用するマルチアカウント環境において、複数のAWSアカウントやクラウドアプリケーションへのアクセスを一元的に管理し、シングルサインオン（SSO）を実現するサービスです。外部のIDプロバイダー（Microsoft Entra ID、Oktaなど）と連携でき、ユーザーは1つの認証情報でポータルにログインし、許可されたアカウントやアプリへ簡単にアクセス可能。アクセス権限（許可セット）の割り当てと管理も集中できるため、セキュリティ強化と運用効率化を実現します。",
    "tags": [
      "IAM"
    ]
  },
  {
    "term": "シングルサインオン（SSO）",
    "desc": "シングルサインオン（SSO）とは、一度のログイン認証で複数のシステムやアプリケーションにアクセスできるようになる仕組みです。複数のIDとパスワードを管理する手間を省き利便性を向上させ、管理するパスワードが減ることでセキュリティリスクも低減できるため、企業などで広く導入されています。",
    "tags": [
      "IAM"
    ]
  },
  {
    "term": "インメモリデータベース（IMDB）",
    "desc": "インメモリデータベース（IMDB）とは、データをディスクではなくコンピュータのメインメモリ（RAM）に直接保存・処理するデータベースで、ディスクアクセスが不要なため、従来のデータベースに比べて桁違いに高速なデータ読み書きと応答時間を実現します。リーダーボード、リアルタイム分析、キャッシュなど、ミリ秒単位の応答が求められるアプリケーションに最適ですが、メモリは高価で電源を切ると消えるため、永続化（ディスクへの保存）機能との併用が一般的です",
    "tags": [
      "DB"
    ]
  }
]